---
layout: post_layout
title: Redis入门-2
time: 2017年4月20日 星期四
location: 北京
pulished: true
excerpt_separator: "**LPUSH**的作用是将"
---
**Redis入门(二)**　　**2017年4月20日**　　**天气：晴转阴**  

**1.Redis列表**  
Redis 列表是简单的字符串列表，按照插入顺序排序。你可以添加一个元素到列表的头部（左边）或者尾部（右边）**LPUSH**命令插入一个新的元素导头部, 而**RPUSH**插入一个新元素导尾部.  
**1.1添加元素--LPUSH指令**  
**LPUSH**的作用是将一个或多个值**value**插入到列表**key**的表头，基本语法：
```
LPUSH key value [value ...]
```
示例：将Tony添加到朋友列表。
```
redis> LPUSH friends Tony
```
如果有多个**value**值，那么各个**value**值按从左到右的顺序依次插入到表头,比如说，对空列表mylist执行命令**LPUSH mylist a b c**，列表的值将是**c b a**。  
如果**key**不存在，一个空列表会被创建并执行**LPUSH**操作。  
执行成功时，返回列表长度，当**key**存在但不是列表类型时，返回一个错误。  
**1.2设置指定位置元素--LSET**  
**LSET**可以将列表**key**下标为**index**的元素的值设置为**value**，基本语法：  
```
LSET key index value
```
示例：  
```
redis>LSET friends 0 Lucy
ok
```
需要注意的是，列表**key**必须是已存在的，而且**index**不能超出列表长度范围。  
**1.3取出元素--LPOP**  
**LPOP**命令执行时会移除列表第一个元素，并将其返回,基本语法：  
```
LPOP key
```
示例：取出friends中的第一个元素。
```
redis>LPOP friends 
Lucy
```
请注意，**LPOP**命令会移除列表中的元素，如果仅仅是想要获取该元素，那么就不应该使用LPOP操作，因为redis中有专门获取元素的命令。  
**1.4获取指定位置元素--LINDEX**  
如果要获取列表元素，**LINDEX**命令是比较常用的，使用**LINDEX**，我们可以获取到指定位置的**value**，基本语法：
```
LINDEX key index
```
示例：获取friends的第一个元素。
```
redis>LINDEX friends 0
Tony
```
**下标(index)**为正数时，0表示第一个元素，1表示第二个元素，以此类推。  
**下标**可以是负数，以 -1 表示列表的最后一个元素， -2 表示列表的倒数第二个元素，以此类推。  
**1.5插入元素--LINSERT**  
插入元素是一个必要功能，**LINSERT**可以将值**value**插入到列表**key**当中，位于值**pivot**之前或之后，基本语法：
```
LINSERT key BEFORE|AFTER pivot value
```
示例：将Andy插入到Lucy之前。
```
redis> LINSERT friends BEFORE "Lucy" "Andy"
(integer) 3
```
当**pivot**不存在于列表**key**时，不执行任何操作。  
当**key**不存在时，**key**被视为空列表，不执行任何操作。  
如果**key**不是列表类型，返回一个错误。  
**1.6移除元素--LREM**   
在redis中，移除列表元素使用**LREM**命令，根据参数**count**的值，移除列表中与参数**value**相等的元素，基本语法：  
```
LREM key count value
```
示例：移除friends中，所有的名叫‘Tom’的元素。
```
redis> LREM friends 0 Tom
(integer) 1
```
count 的值可以是以下几种：  
count > 0 : 从**表头开始向表尾**搜索，移除与**value**相等的元素，数量为**count**。  
count < 0 : 从**表尾开始向表头**搜索，移除与**value**相等的元素，数量为**count**的绝对值。  
count = 0 : 移除表中**所有**与**value**相等的值。  
**1.7列表长度--LLEN**  
在redis中，**LLEN**命令可以获取到列表的长度，基本语法：  
```
LLEN key
```
示例：查看myList列表长度。
```
redis> LLEN mylist
(integer) 0
``` 
返回列表**key**的长度。  
如果**key**不存在，则**key**被解释为一个空列表，返回 0 。  
如果**key**不是列表类型，返回一个错误。  
**1.8剪切列表--LTRIM**  
**LTRIM**可以对一个列表进行修剪，就是说，让列表只保留指定区间内的元素，不在指定区间之内的元素都将被删除，基本语法：
```
LTRIM key start stop
```
示例：只保留列表list的前三个元素，其余元素全部删除。
```
LTRIM list 0 2 
```
下标(index)参数**start**和**stop**都以 0 为底，也就是说，以 0 表示列表的第一个元素，以 1 表示列表的第二个元素，以此类推。  
你也可以使用负数下标，以 -1 表示列表的最后一个元素， -2 表示列表的倒数第二个元素，以此类推。  

---
**2.Redis集合**  
Redis集合(Set)是一个**无序的字符串集合**。 你可以快速的完成添加、删除、以及测试元素是否存在。  
Redis集合拥有令人满意的不允许包含相同成员的属性。多次添加相同的元素，最终在集合里只会有一个元素。 实际上说这些就是意味着在添加元素的时候无须检测元素是否存在。一个Redis集合的非常有趣的事情是他支持一些服务端的命令从现有的集合出发去进行集合运算，因此你可以在非常短的时间内进行合并(unions), 求交集(intersections),求差集(differences of sets)。  
**2.1添加--SADD**  
集合操作中，**SADD**命令可以将一个或多个**member**元素加入到集合**key**当中，已经存在于集合的**member**元素将被忽略，基本语法：
```
SADD key member [member ...]
```
示例：添加‘tom’到room集合中。
```
redis> SADD room "tom"
(integer) 1
```
假如**key**不存在，则创建一个只包含**member**元素作成员的集合。  
当**key**不是集合类型时，返回一个错误。  
**2.2随机取出--SPOP**  
如果我们需要随机取出集合中的某个元素，可以使用**SPOP**命令，基本语法：
```
SPOP key
```
示例:随机取出website集合中的元素。
```
redis> SPOP website
"hubwiz.com"
```
需要注意的是，执行**SPOP**命令返回的元素将被**移除**该集合。  
**2.3获取全部元素--SMEMBERS**  
如果要获取集合中全部的元素，则需要使用**SMEMBERS**命令，基本语法如下：
```
SMEMBERS key
```
示例：获取website集合中全部的元素。
```
redis> SMEMBERS 获取website集合中全部的元素
1) "www.hubwiz.com"
2) "lab123.hubwiz.com"
```
**SMEMBERS**命令只会返回集合中的全部成员，**并不会移除它们**，如果集合不存在，则视为空集合。  
**2.4元素数量--SCARD**   
如果想要查看集合中元素的数量，可以使用**SCARD**命令，基本语法：
```
SCARD key
```
示例：查看website集合中元素的数量。
```
redis>SCARD website
(integer) 3
```
执行**SCARD**命令，当集合存在时，返回集合中元素的数量，若集合不存在，则返回0。  
**2.5差集--SDIFF**  
假如现在有两个集合，我们想要获取到它们之间不同的元素，通常情况下，我们需要通过循环集合来比较，然后取得不同的元素。
在redis里面取得集合的差集非常简单，通过**SDIFF**命令即可轻松实现，基本语法：
```
SDIFF key [key ...]
```
示例：取得mySet1和mySet2的差集。
```
redis> SMEMBERS mySet1
1) "bet man"
2) "start war"
3) "2012"
 
redis> SMEMBERS mySet2
1) "hi, lady"
2) "Fast Five"
3) "2012"
 
redis> SDIFF mySet1 mySet2
1) "bet man"
2) "start war"
```
如果**key**都存在，则返回一个集合的全部成员，该集合是所有给定集合之间的差集。  
不存在的**key**被视为空集。  
**2.6交集--SINTER**  
在redis中获取集合的交集也是非常简单的，执行**SINTER**命令将返回集合的交集，基本语法：
```
SINTER key [key ...]
```
示例：获取集合group1和group2的交集。
```
redis> SMEMBERS group1
1) "LI LEI"
2) "TOM"
3) "JACK"
 
redis> SMEMBERS group2
1) "HAN MEIMEI"
2) "JACK"
 
redis> SINTER group1 group2
1) "JACK"
```
当集合都存在时，将返回一个集合的全部成员，该集合是所有给定集合的交集。  
不存在的集合被视为空集。因此，当给定集合当中有一个空集时，结果也为空集(根据集合运算定律)。  
**2.7并集--SUNION**  
既然有差集和交集运算，当然少不了并集，在redis中，执行**SUNION**命令将返回给定集合的并集，基本语法：
```
SUNION key [key ...]
```
示例：获取集合songs和my_songs的并集。
```
redis> SMEMBERS songs
1) "Billie Jean"
 
redis> SMEMBERS my_songs
1) "Believe Me"
 
redis> SUNION songs my_songs
1) "Billie Jean"
2) "Believe Me"
```
如果给定的集合都存在，则返回一个集合的全部成员，该集合是所有给定集合的并集。  
同样，不存在的集合被视为空集。  
**2.8包含判断--SISMEMBER**  
如果要判断集合是否包含某个元素也不需要循环对比了，因为redis提供**SISMEMBER**命令可以实现这个功能，基本语法：
```
SISMEMBER key member
```
示例：判断member元素是否集合key的成员。
```
redis> SMEMBERS website
1) "hubwiz.com"
2) "google.com"
3) "baidu.com"
 
redis> SISMEMBER website "hubwiz.com"
(integer) 1
```
如果集合包含给定的元素，则返回1，反之则返回0。  
**2.9移动元素--SMOVE**  
执行**SMOVE**可以移动元素，基本语法：
```
SMOVE source destination member
```
将**member**元素从**source**集合移动到**destination**集合。**SMOVE**是原子性操作，因此可以保证数据的一致性。  
示例：将songs集合中的歌曲‘Believe Me’移动到‘my_songs’集合。
```
redis> SMEMBERS songs
1) "Billie Jean"
2) "Believe Me"
 
redis> SMEMBERS my_songs
(empty list or set)
 
redis> SMOVE songs my_songs "Believe Me"
(integer) 1
 
redis> SMEMBERS songs
1) "Billie Jean"
 
redis> SMEMBERS my_songs
1) "Believe Me"
```
如果**source**集合不存在或不包含指定的**member**元素，则**SMOVE**命令不执行任何操作，仅返回 0 。否则，**member**元素从**source**集合中被移除，并添加到**destination**集合中去。  
当**destination**集合已经包含**member**元素时，**SMOVE**命令只是简单地将**source**集合中的**member**元素删除。  
当**source**或**destination**不是集合类型时，返回一个错误。  
**2.10移除元素--SREM**   
执行命令**SREM**可以将元素从集合中移除，基本语法：
```
SREM key member [member ...]
```
示例：从languages集合中移除ruby。
```
redis> SMEMBERS languages    # 测试数据
1) "c"
2) "lisp"
3) "python"
4) "ruby"
 
redis> SREM languages ruby     # 移除单个元素
(integer) 1
```
移除集合**key**中的一个或多个**member**元素，不存在的**member**元素会被忽略。  

---
**3.Redis有序集合**  
　　Redis有序集合与普通集合非常相似，是一个没有重复元素的字符串集合。不同之处是有序集合的每个成员都关联了一个评分，这个评分被用来按照从最低分到最高分的方式排序集合中的成员。集合的成员是唯一的，但评分可以重复。  
　　使用有序集合你可以以非常快的速度添加 、删除和更新元素。因为元素是有序的, 所以你也可以很快的根据评分(score)或者次序(position)来获取一个范围的元素。  
　　访问有序集合的中间元素也是非常快的,因此你能够使用有序集合作为一个没有重复成员的智能列表。在有序集合中，你可以很快捷的访问一切你需要的东西：有序的元素，快速的存在性测试，快速访问集合的中间元素！  
**3.1添加成员--ZADD**   
在redis中，使用**ZADD**命令将一个或多个**member**元素及其**score**值加入到有序集**key**当中，基本语法： 
```
ZADD key score member [[score member] [score member] ...]
```
示例：添加google.com到rank集合，评分5。
```
# 添加单个元素
redis> ZADD rank 10 google.com
(integer) 1
```
如果某个**member**已经是有序集的成员，那么更新这个**member**的**score**值，并通过重新插入这个**member**元素，来保证该**member**在正确的位置上。  
**score**值可以是整数值或双精度浮点数。  
如果**key**不存在，则创建一个空的有序集并执行**ZADD**操作。  
当**key**存在但不是有序集类型时，返回一个错误。  
**3.2移除成员--ZREM**  
**ZREM**命令可以移除指定成员，基本语法如下：
```
ZREM key member [member ...]
```
示例：移除rank集合中google.com元素。
```
redis> ZREM rank google.com
```
执行成功，google.com元素将从rank集合中移除，如果google.com不存在，将被忽略。  
如果rank集合存在但不是有序集类型时，返回一个错误。  
**3.3获取成员评分--ZSCORE**  
redis中使用**ZSCORE**命令来获取成员评分，基本语法：
```
ZSCORE key member
```
示例：获取集合salary中元素peter的评分。
```
redis> ZSCORE salary peter              # 注意返回值是字符串
```
如果peter是集合salary的成员，则返回成员peter的评分值。  
如果peter元素不是有序集salary的成员，或salary不存在，则返回nil。  
**3.4获取指定区域成员--ZRANGE**  
如果想要获取集合成员，可以使用**ZRANGE**命令，基本语法：
```
ZRANGE key start stop [WITHSCORES]
```
示例：获取salary集合的全部成员。
```
redis > ZRANGE salary 0 -1 WITHSCORES             # 显示整个有序集成员
1) "jack"
2) "3500"
3) "tom"
4) "5000"
5) "boss"
6) "10086"
```
返回的成员的位置**按score值递增(从小到大)来排序**。  
**3.5成员数量--ZCARD**  
如果需要查看集合成员的数量，那么我们需要使用到**ZCARD**命令，基本语法如下：
```
ZCARD key
```
示例：查看salary集合的成员数量。
```
redis > ZCARD salary
(integer) 2
```
执行成功，将返回有序集salary的成员总数。  
**3.6成员数量--ZCOUNT**  
除了**ZCARD**命令以外，**ZCOUNT**命令也可以查看成员的数量，和前者不同的是，**ZCOUNT**命令可以设定评分的最小和最大值：
```
ZCOUNT key min max
```
示例：查看薪水在2000-5000之间的人数。
```
redis> ZRANGE salary 0 -1 WITHSCORES    # 测试数据
1) "jack"
2) "2000"
3) "peter"
4) "3500"
5) "tom"
6) "5000"
 
redis> ZCOUNT salary 2000 5000  
(integer) 3
```
执行成功，将返回有序集key中，score值在min和max之间(默认包括score值等于min或max)的成员的数量。  
**3.7排名--ZRANK**  
**ZRANK**命令可以获取到给定元素在集合中的排名，排名依据评分(score)值递增(从小到大)顺序排列，语法格式：
```
ZRANK key member
```
示例：显示tom的薪水排名。
```
redis> ZRANGE salary 0 -1 WITHSCORES        #显示所有成员及其score值
1) "peter"
2) "3500"
3) "tom"
4) "4000"
5) "jack"
6) "5000"
 
redis> ZRANK salary tom                    
(integer) 1
```
排名以 0 为底，也就是说，score值最小的成员排名为 0 。  
使用**ZREVRANK**命令可以获得成员按**score**值递减(从大到小)排列的排名。  
**3.8增量--ZINCRBY**  
**ZINCRBY**命令可以为给定的成员评分值加上增量，语法格式：
```
ZINCRBY key increment member
```
示例：为salary集合中的tom加薪500。
```
redis> ZSCORE salary tom
"2000"
 
redis> ZINCRBY salary 500 tom   #tom加薪
"2500"
```
可以通过传递一个负数值increment，让score减去相应的值，比如ZINCRBY key -5 member ，就是让member的score值减去 5 。  
当key不存在，或member不是key的成员时，ZINCRBY key increment member 等同于ZADD key increment member 。  
当key不是有序集类型时，返回一个错误。  
score值可以是整数值或双精度浮点数。  

---
**4.Redis中KEYS相关指令**  
**4.1键管理--KEYS**  
Redis的**keys**命令用于管理键。使用Redis的**keys**命令,语法格式：
```
KEYS pattern
```
查找所有符合给定模式pattern的key。  
示例：查找包含o的键。 
```
redis> MSET one 1 two 2 three 3 four 4  # 一次设置 4 个 key
OK
 
redis> KEYS *o*
1) "four"
2) "two"
3) "one"
```
KEYS * 匹配数据库中所有key。  
KEYS h?llo 匹配hello，hallo和hxllo等。  
KEYS h*llo 匹配hllo和heeeeello等。  
KEYS h[ae]llo 匹配hello和hallo，但不匹配hillo。  
特殊符号用 \ 隔开。  
**4.2判断存在--EXISTS**  
**EXISTS**命令的作用是判断指定**key**是否存在，语法格式如下：
```
EXISTS key
```
示例：判断db是否存在。
```
redis> SET db "redis"
OK
 
redis> EXISTS db
(integer) 1
 
redis> DEL db
(integer) 1
 
redis> EXISTS db
(integer) 0
```
若key存在，返回 1 ，否则返回 0 。  
**4.3移动--MOVE**  
**MOVE**命令的作用是将当前数据库的**key**移动到给定的数据库**db**当中,语法如下：
```
MOVE key db
```
如果当前数据库(源数据库)和给定数据库(目标数据库)有相同名字的给定key，或者key不存在于当前数据库，那么 MOVE 没有任何效果。  
因此，也可以利用这一特性，将**MOVE**当作锁(locking)原语(primitive)。  
示例：将数据库0中的song，移动到数据库1。
```
# key存在于当前数据库
redis> SELECT 0     #redis默认使用数据库0，为了清晰起见，这里再显式指定一次。
OK
 
redis> SET song "secret base - Zone"
OK
 
redis> MOVE song 1       #将song移动到数据库 1
(integer) 1
 
redis> EXISTS song       #song已经被移走
(integer) 0
 
redis> SELECT 1          #使用数据库 1
OK
 
redis:1> EXISTS song        #证实 song 被移到了数据库(1注意命令提示符变成了"redis:1"，表明正在使用数据库 1)
(integer) 1
```
**4.4重命名--RENAME**  
**RENAME**命令可以将原有的**key**修改为新的**key**名称，语法如下：
```
RENAME key newkey
```
示例：重名message。
```
redis> SET message "hello world"
OK
 
redis> RENAME message greeting
OK
 
redis> EXISTS message               # message 不复存在
(integer) 0
 
redis> EXISTS greeting              # greeting 取而代之
(integer) 1
```
当key和newkey相同，或者key不存在时，返回一个错误。  
当newkey已经存在时，RENAME命令将覆盖旧值。  
**4.5排序--SORT**  
排序是很常见的需求，在redis中可以使用**SORT**命令来实现排序，语法格式如下：
```
SORT key [BY pattern] [LIMIT offset count] [GET pattern [GET pattern ...]] [ASC | DESC] [ALPHA] [STORE destination]
```
示例:
```
# 开销金额列表
redis> LPUSH cost 30 1.5 10 8
(integer) 4
# 排序
redis> SORT cost
1) "1.5"
2) "8"
3) "10"
4) "30"
```
使用**SORT**命令，可以返回或保存给定列表、集合、有序集合**key**中经过排序的元素。  
排序默认以数字作为对象，值被解释为双精度浮点数，然后进行比较。  
**4.6序列化--DUMP**  
redis支持序列化，使用**DUMP**命令来序列化给定**key**的值，语法如下：
```
DUMP key
```
示例：序列化say。
```
redis> SET say "hello world!"
OK
 
redis> DUMP say
"\x00\x15hello world!\x06\x00E\xa0Z\x82\xd8r\xc1\xde"
 
redis> DUMP not-exists-key
(nil)
```
执行**DUMP**命令序列化成功后，将返回被序列化的值，若**key**不存在，则返回nil。  
**4.7设置生存时间--EXPIRE**  
为**key**设置生存时间需要使用**EXPIRE**命令，语法格式：
```
EXPIRE key seconds
```
示例：设置rank的过期时间为30秒。
```
redis> EXPIRE rank 30  # 设置过期时间为 30 秒
(integer) 1
```
为给定**key**设置生存时间，当**key**过期时(生存时间为 0 )，它会被自动删除。  
在Redis中，带有生存时间的**key**被称为(易失的)(volatile)。  
生存时间可以通过使用**DEL**命令来删除整个**key**来移除，或者被**SET**和**GETSET**命令覆写(overwrite)，这意味着，如果一个命令只是修改(alter)一个带生存时间的**key**的值而不是用一个新的**key**值来代替(replace)它的话，那么生存时间不会被改变。  
**4.8剩余生存时间--TTL**  
**TTL**命令的作用是获取给定**key**剩余生存时间(TTL, time to live)，语法格式如下：
```
TTL key
```
示例：查看key剩余生存时间。
```
# 有剩余生存时间的 key
redis> EXPIRE key 10086
(integer) 1
redis> TTL key
(integer) 10084
```
当**key**不存在时，返回 -2 。 当**key**存在但没有设置剩余生存时间时，返回 -1 。 否则，以秒为单位，返回**key**的剩余生存时间。


























